In [3]:
import pandas as pd
import glob
import os

In [4]:
input_path = '.'
file_list = glob.glob(os.path.join(input_path,'sales_*'))
file_list

['.\\sales_february_2014.csv',
 '.\\sales_january_2014.csv',
 '.\\sales_march_2014.csv']

In [29]:
sales_february_2014_df = pd.read_csv(file_list[0])
result1 = sales_february_2014_df['Sale Amount'].str.strip('$').str.replace(',','').astype('float64')
result1_sum = result1.sum()
result1_sum

9375.0

In [30]:
result1_average = result1.mean()
result1_average

1562.5

In [ ]:
sales_february_2014_df

In [6]:
sales_january_2014_df = pd.read_csv(file_list[1])
sales_january_2014_df

   Customer ID       Customer Name Invoice Number Sale Amount Purchase Date
0         1234          John Smith       100-0002   $1,200.00        1/1/14
1         2345       Mary Harrison       100-0003   $1,425.00        1/6/14
2         3456          Lucy Gomez       100-0004   $1,390.00       1/11/14
3         4567        Rupert Jones       100-0005   $1,257.00       1/18/14
4         5678       Jenny Walters       100-0006   $1,725.00       1/24/14
5         6789  Samantha Donaldson       100-0007   $1,995.00       1/31/14

In [7]:
sales_march_2014_df = pd.read_csv(file_list[2])
sales_march_2014_df

   Customer ID  Customer Name Invoice Number Sale Amount Purchase Date
0         1234     John Smith       100-0014   $1,350.00        3/4/14
1         8765      Tony Song       100-0015   $1,167.00        3/8/14
2         2345  Mary Harrison       100-0016   $1,789.00       3/17/14
3         6543     Rachel Paz       100-0017   $2,042.00       3/22/14
4         3456     Lucy Gomez       100-0018   $1,511.00       3/28/14
5         4321  Susan Wallace       100-0019   $2,280.00       3/30/14

In [20]:
result2 = result1['Sale Amount'].str.strip('$').str.replace(',','').astype('float64')
result2

0     1115.0
1     1367.0
2     2135.0
3     1346.0
4     1560.0
5     1852.0
6     1200.0
7     1425.0
8     1390.0
9     1257.0
10    1725.0
11    1995.0
12    1350.0
13    1167.0
14    1789.0
15    2042.0
16    1511.0
17    2280.0
Name: Sale Amount, dtype: float64